CSI API ETABS v1
cDesignCompositeColumn.VerifyPassed Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int VerifyPassed(
	ref int NumberItems,
	ref int N1,
	ref int N2,
	ref string[] MyName
)
Function VerifyPassed (
	ByRef NumberItems As Integer,
	ByRef N1 As Integer,
	ByRef N2 As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cDesignCompositeColumn
Dim NumberItems As Integer
Dim N1 As Integer
Dim N2 As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.VerifyPassed(NumberItems,
	N1, N2, MyName)
int VerifyPassed(
	int% NumberItems,
	int% N1,
	int% N2,
	array<String^>^% MyName
)
abstract VerifyPassed :
        NumberItems : int byref *
        N1 : int byref *
        N2 : int byref *
        MyName : string[] byref -> int
Parameters
NumberItems
Type: System.Int32
N1
Type: System.Int32
N2
Type: System.Int32
MyName
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDesignCompositeColumn Interface
ETABSv1 Namespace